/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {}
    },
    "slideshow": {
      "type": "slideshow",
      "blocks": {
        "slideshow-0": {
          "type": "image",
          "settings": {
            "top_subheading": "",
            "title": "",
            "title_size": 80,
            "subheading": "",
            "link": "",
            "link_text": "",
            "link_2": "",
            "link_text_2": "",
            "color_accent": "rgba(0,0,0,0)",
            "text_align": "vertical-center horizontal-center",
            "image": "shopify://shop_images/ChatGPT_Image_13_nov_2025_07_16_38.png",
            "overlay_opacity": 0,
            "focal_point": "center center"
          }
        }
      },
      "block_order": [
        "slideshow-0"
      ],
      "settings": {
        "section_height": "650px",
        "mobile_height": "auto",
        "parallax": false,
        "style": "bars",
        "autoplay": true,
        "autoplay_speed": 7
      }
    },
    "rich-text": {
      "type": "rich-text",
      "blocks": {
        "text": {
          "type": "text",
          "settings": {
            "enlarge_text": false,
            "text": "<p>Welcome to <strong>Elowen Boutique</strong>, a destination where elegance, quality, and personal connection meet. Since 2010, we’ve been dedicated to offering a curated selection of fashion that empowers women to feel confident, stylish, and themselves — every day.</p><p>Located in one of Boston’s most charming areas, our boutique blends modern trends with timeless pieces, creating a collection that feels both current and enduring. Whether you’re searching for an everyday essential or a standout look for a special moment, Elowen Boutique is the place to find it.</p><p>As a proud family-driven brand, we’re built on passion, dedication, and genuine care. At Elowen Boutique, it’s all about you. We believe in warm service, attention to detail, and creating an atmosphere where every customer feels welcome and seen. Our team of style experts is always ready to help you discover pieces that reflect your personality and make you feel amazing.</p><p>From minimalist essentials to eye-catching statement pieces — our collection is as diverse as the women who wear it.</p><p>We invite you to experience what makes Elowen Boutique unique:<br/>a place where fashion meets authenticity, and every visit feels like coming home.</p>"
          }
        }
      },
      "block_order": [
        "text"
      ],
      "settings": {
        "align_text": "center",
        "narrow_column": true,
        "divider": false
      }
    },
    "form": {
      "type": "contact-form",
      "settings": {
        "title": "Contact us",
        "text": "",
        "show_phone": false,
        "narrow_column": true
      }
    }
  },
  "order": [
    "main",
    "slideshow",
    "rich-text",
    "form"
  ]
}
